## How to use jupyter notebook
#### Lol, I amn using one in vscode

### Lets learn PANDAS
##### written in C
##### use for dataframs (matrices).
converts from json very well(use of dictionary) 
### Lets learn NumPy
Lots of things
### Lets learn matplotlib
Graphs n' stuff

In [1]:
#Treat Pandas as pd
import pandas as pd
dfa = pd.DataFrame(
    {"Name": [
        "Braund, Mr. Own Harris",
        "Allen, Mr. William Henry",
        "Bonnell, Miss. Elizabeth",
    ],
        "Age":[22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)
dfa["Name"]

0      Braund, Mr. Own Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
Name: Name, dtype: object

In [2]:
dfa.to_excel('dfa.xlsx')

In [3]:
ages = dfa["Age"]
ages

0    22
1    35
2    58
Name: Age, dtype: int64

Each column in a DataFrame is a Series

In [6]:
ages.max()

58

In [7]:
dfa.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [8]:
manifest = pd.read_csv('data/t_raw_data.csv')

In [9]:
manifest.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
excel_file = pd.read_excel("dfa.xlsx")
excel_file

   Unnamed: 0                      Name  Age     Sex
0           0    Braund, Mr. Own Harris   22    male
1           1  Allen, Mr. William Henry   35    male
2           2  Bonnell, Miss. Elizabeth   58  female

In [11]:
manifest.to_excel("manifest_spreadsheet.xlsx",sheet_name="passengers", index = False)

In [ ]:
manifest2 = pd.read_excel("manifest_spreadsheet.xlsx",
sheet_name="passengers")
manifest2.head()